package exercise.yandex.dev.tasks.deliveryCalculator;



/*
*Задача 5: Калькулятор доставки
Рассчитать стоимость доставки заказа. Зависит от: веса, габаритов, расстояния, тарифа (эконом/экспресс).
* Хрупкий груз — наценка. Превышение габаритов — отказ.
DeliveryResult calculate(Package pkg, String tariff, int distanceKm)
*
*
*Package(String name, Size size, boolean isGlass)
* Size(int length,int wide,int height)
* DeliveryResult()
* Tariff(ECONOM,ESPRESSO)
* */



public class Main {
    public static void main(String[] args) {
        System.out.println("qwe");
    }
}
